<a href="https://colab.research.google.com/github/GertkingABP/Sii_labs/blob/main/SII_L2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Задание: Создать фрейм данных из N записей со следующими полями: Nrow – номер записи, Name – имя сотрудника, BirthYear – год рождения, EmployYear – год приема на работу, Salary – зарплата. Заполнить данный фрейм данными так, что Nrow изменяется от 1 до N. Name задается произвольно, BirthYear распределено равномерно (случайно) на отрезке [1960, 1995], EmployYear распределен равномерно на отрезке [BirthYear+18, 2009], Salary задается произвольно в интервале от 15000 до 50000. Подсчитать число сотрудников с зарплатой, больше 25000. Добавить в таблицу поле, соответствующее суммарному подоходному налогу (ставка 15%), выплаченному сотрудником за время работы в организации.

In [2]:
# исходное число записей и последовательность для нумерации
N <- 150
Nrow <- 1:N

In [3]:
# формирование вектора случайно сгенерированных имен
gen_name <- function(x) {
  # lists of names examples
  name_list <- c("Billy", "Sue", "Jim", "Tommy", "Sam", "Andrea", "Liza")
  surname_list<- c("Swith", "Bay", "Brown", "Jackson", "Willson", "Connor", "Sweet")
  
  names_len <- length(name_list)
  
  emp_name <- paste(
    name_list[sample(1:names_len, 1)], 
    surname_list[sample(1:names_len, 1)]
  )
  emp_name
}

Name <- sapply(Nrow, gen_name)

In [4]:
# остальные вектора
gen_empl_year <- function(birthday) {
  sample((birthday + 18):2009, 1)
}

BirthYear <- sample(1960:1995, N, replace=T)

EmployYear <- sapply(BirthYear, gen_empl_year)

Salary <- sample(15000:50000, N, replace=T)

In [5]:
# собираем датафрейм и выводим его
df <- data.frame(
  Nrow=Nrow,
  Name=Name,
  BirthYear=BirthYear,
  EmployYear=EmployYear,
  Salary=Salary
)

head(df)

  Nrow Name           BirthYear EmployYear Salary
1 1    Andrea Willson 1967      1994       26626
2 2    Sue Willson    1966      1997       19016
3 3    Sue Swith      1980      2002       15413
4 4    Sue Swith      1969      2003       28679
5 5    Tommy Swith    1968      1986       49798
6 6    Tommy Bay      1983      2005       16884

In [6]:
salary_cmp_count <- nrow(df[df$Salary > 25000,])
cat(sprintf("Число сотрудников с зарплатой, больше 25000: %i", salary_cmp_count))

Число сотрудников с зарплатой, больше 25000: 110

In [7]:
# расчет суммарного подоходного налога за все время работы в организации
currrent_year <- as.numeric(format(Sys.Date(), format="%Y"))
df$TotalIncomeTax <- with(df, (currrent_year - EmployYear)*Salary*0.15)

# финальный результат
head(df)

  Nrow Name           BirthYear EmployYear Salary TotalIncomeTax
1 1    Andrea Willson 1967      1994       26626  111829.20
2 2    Sue Willson    1966      1997       19016   71310.00
3 3    Sue Swith      1980      2002       15413   46239.00
4 4    Sue Swith      1969      2003       28679   81735.15
5 5    Tommy Swith    1968      1986       49798  268909.20
6 6    Tommy Bay      1983      2005       16884   43054.20